mock-example/src/test/resources/xml/CRM/UpdateDeal/rq1.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <crm:updateDealRq xmlns:crm="http://sbrf.ru/NCP/CRM/" xmlns:upd="http://sbrf.ru/NCP/CRM/UpdateDealRq/">
            <upd:deal>
                <upd:dealID>string</upd:dealID>
                <!--Optional:-->
                <upd:contractID>string</upd:contractID>
                <upd:dealCreationDate>2008-09-29T05:49:45</upd:dealCreationDate>
                <upd:dealEssense>string</upd:dealEssense>
                <upd:requestPurpose>string</upd:requestPurpose>
                <upd:salesMethod>string</upd:salesMethod>
                <upd:dealStatus>string</upd:dealStatus>
                <upd:requestDate>2014-09-19</upd:requestDate>
                <upd:origOrgUnit>string</upd:origOrgUnit>
                <upd:origOrgDivision>string</upd:origOrgDivision>
                <upd:clientFileID>string</upd:clientFileID>
                <upd:dealFileID>string</upd:dealFileID>
                <upd:comment>string</upd:comment>
                <upd:supLMID>string</upd:supLMID>
                <upd:clientManagerID>string</upd:clientManagerID>
                <!--Zero or more repetitions:-->
                <upd:products>
                    <upd:productID>100</upd:productID>
                    <upd:productName>string</upd:productName>
                    <upd:category>string</upd:category>
                    <!--1 or more repetitions:-->
                    <upd:productInfo>
                        <upd:purpose>string</upd:purpose>
                        <upd:creditMode>string</upd:creditMode>
                        <upd:currencyOfFunding>str</upd:currencyOfFunding>
                        <upd:currency>str</upd:currency>
                        <upd:interestRateType>string</upd:interestRateType>
                        <upd:selectionSchedule>string</upd:selectionSchedule>
                        <upd:changesSchedule>string</upd:changesSchedule>
                        <upd:selectionSchedulePeriod>string</upd:selectionSchedulePeriod>
                        <upd:changesSchedulePeriod>string</upd:changesSchedulePeriod>
                        <upd:interestRateOrder>string</upd:interestRateOrder>
                        <upd:interestPaymentOrder>string</upd:interestPaymentOrder>
                        <upd:refinancing>true</upd:refinancing>
                        <upd:providing>string</upd:providing>
                        <upd:suspensiveСondition>string</upd:suspensiveСondition>
                        <upd:principal>1.051732E7</upd:principal>
                        <upd:principalBaseCurrency>1.051732E7</upd:principalBaseCurrency>
                        <upd:startDate>2018-11-01+04:00</upd:startDate>
                        <upd:interestRate>1.051732E7</upd:interestRate>
                        <upd:creditTerm>100</upd:creditTerm>
                        <upd:period>100</upd:period>
                        <upd:gracePeriod>100</upd:gracePeriod>
                        <upd:repaymentSchedule>string</upd:repaymentSchedule>
                        <upd:turnover>100</upd:turnover>
                        <upd:covenants>string</upd:covenants>
                        <upd:minRate>1.051732E7</upd:minRate>
                        <upd:proposedCollateral>string</upd:proposedCollateral>
                        <upd:debtLimit>string</upd:debtLimit>
                        <upd:pledgeInsurance>string</upd:pledgeInsurance>
                        <upd:customerProspects>string</upd:customerProspects>
                        <upd:financingTerm>string</upd:financingTerm>
                        <upd:firstCountry>string</upd:firstCountry>
                        <upd:lastCountry>string</upd:lastCountry>
                        <!--Zero or more repetitions:-->
                        <upd:fee>
                            <upd:feeName>string</upd:feeName>
                            <upd:anotherFeeName>string</upd:anotherFeeName>
                            <upd:calculationBase>string</upd:calculationBase>
                            <upd:paymentOrder>string</upd:paymentOrder>
                        </upd:fee>
                        <!--Zero or more repetitions:-->
                        <upd:repaymentScheduleDetails>
                            <upd:sheduleDate>2013-05-22+04:00</upd:sheduleDate>
                            <upd:sheduleAmount>1.051732E7</upd:sheduleAmount>
                        </upd:repaymentScheduleDetails>
                        <!--Zero or more repetitions:-->
                        <upd:selectionScheduleDetails>
                            <upd:sheduleDate>2002-11-05+03:00</upd:sheduleDate>
                            <upd:sheduleAmount>1.051732E7</upd:sheduleAmount>
                        </upd:selectionScheduleDetails>
                        <!--Zero or more repetitions:-->
                        <upd:changesScheduleDetails>
                            <upd:sheduleDate>2002-06-24+04:00</upd:sheduleDate>
                            <upd:sheduleAmount>1.051732E7</upd:sheduleAmount>
                        </upd:changesScheduleDetails>
                    </upd:productInfo>
                    <!--Zero or more repetitions:-->
                    <upd:collateral>
                        <upd:collateralType>string</upd:collateralType>
                        <upd:ownerID>string</upd:ownerID>
                        <upd:estimatedValue>1.051732E7</upd:estimatedValue>
                        <upd:discountRate>1.051732E7</upd:discountRate>
                        <upd:estimatedValueCorrected>1.051732E7</upd:estimatedValueCorrected>
                        <upd:qualityCategory>string</upd:qualityCategory>
                        <upd:daysForCalculation>100</upd:daysForCalculation>
                        <upd:estimatedValueCorrectedToEAD>1.051732E7</upd:estimatedValueCorrectedToEAD>
                        <upd:securityShare>100</upd:securityShare>
                        <upd:EstimatedValueSource>string</upd:EstimatedValueSource>
                        <upd:estimationDate>2016-02-20+04:00</upd:estimationDate>
                        <upd:businessMeaning>string</upd:businessMeaning>
                        <upd:qualityAndLiquidityEstimation>string</upd:qualityAndLiquidityEstimation>
                        <upd:currency>string</upd:currency>
                        <upd:estimatedValueType>string</upd:estimatedValueType>
                        <upd:guarantorRating>string</upd:guarantorRating>
                    </upd:collateral>
                    <!--Optional:-->
                    <upd:losses>
                        <upd:percentLGD>1.051732E7</upd:percentLGD>
                        <upd:countEAD>1.051732E7</upd:countEAD>
                        <upd:currency>string</upd:currency>
                        <upd:reportDateAmount>1.051732E7</upd:reportDateAmount>
                        <upd:lossELpercent>1.051732E7</upd:lossELpercent>
                        <upd:lossELcount>1.051732E7</upd:lossELcount>
                        <upd:typeLGD>string</upd:typeLGD>
                        <upd:statusLGD>string</upd:statusLGD>
                        <upd:dateLGDcalculated>2019-08-19</upd:dateLGDcalculated>
                        <upd:finalizationDate>2018-02-04+04:00</upd:finalizationDate>
                        <upd:comment>string</upd:comment>
                    </upd:losses>
                </upd:products>
                <upd:project>
                    <upd:projectName>string</upd:projectName>
                    <upd:indicatorsOfConstruction>string</upd:indicatorsOfConstruction>
                    <upd:parcel>string</upd:parcel>
                    <upd:documentsPresence>string</upd:documentsPresence>
                    <upd:equityVolume>string</upd:equityVolume>
                    <upd:repaymentSpring>string</upd:repaymentSpring>
                    <upd:projectVariant>string</upd:projectVariant>
                    <upd:sameIndustryAsBorrower>true</upd:sameIndustryAsBorrower>
                    <upd:collateralProvided>false</upd:collateralProvided>
                    <!--Zero or more repetitions:-->
                    <upd:projectRating>
                        <upd:ratingID>string</upd:ratingID>
                        <upd:ratingValue>1.051732E7</upd:ratingValue>
                        <upd:ratingType>string</upd:ratingType>
                        <upd:ratingModel>string</upd:ratingModel>
                        <upd:ratingCalculatedDate>2014-06-10+04:00</upd:ratingCalculatedDate>
                        <upd:ratingCalculatedRole>string</upd:ratingCalculatedRole>
                        <upd:ratingCalculatedBy>string</upd:ratingCalculatedBy>
                        <upd:ratingApprovalDate>2003-11-10+03:00</upd:ratingApprovalDate>
                        <upd:ratingApprovedBy>string</upd:ratingApprovedBy>
                    </upd:projectRating>
                </upd:project>
                <upd:baseCurrency>str</upd:baseCurrency>
                <!--Zero or more repetitions:-->
                <upd:exchangeRates>
                    <upd:currencyName>string</upd:currencyName>
                    <upd:currencyValue>1.051732E7</upd:currencyValue>
                    <upd:currencyDate>2000-09-25</upd:currencyDate>
                </upd:exchangeRates>
            </upd:deal>
        </crm:updateDealRq>
    </soap:Body>
</soap:Envelope>